Pyspark Handling Missing Values:
    Dropping Columns
    Dropping Rows
    Various Parameter In Dropping functionalities
    Handling Missing values by Mean, Median And Mode

In [1]:
from pyspark.sql import SparkSession

In [2]:
spark = SparkSession.builder.appName('Dataframe part2').getOrCreate()

In [3]:
spark

In [4]:
df = spark.read.csv('employee_data.csv',header=True,inferSchema=True)
df

DataFrame[Name: string, Age: int, Experience (Years): int, Salary: int]

In [5]:
df.show()

+---------+----+------------------+------+
|     Name| Age|Experience (Years)|Salary|
+---------+----+------------------+------+
|    Krish|  31|                10| 30000|
|Sudhanshi|  30|                 8| 25000|
|    Sunny|  29|                 4| 20000|
|     Paul|  24|                 3| 20000|
|   Harsha|  21|                 1| 15000|
|  Shubham|  23|                 2| 18000|
|   Mahesh|NULL|              NULL| 38000|
|     NULL|  34|                10|  NULL|
|     NULL|  36|              NULL|  NULL|
+---------+----+------------------+------+

In [6]:
# drop column
df.drop('Name').show()

+----+------------------+------+
| Age|Experience (Years)|Salary|
+----+------------------+------+
|  31|                10| 30000|
|  30|                 8| 25000|
|  29|                 4| 20000|
|  24|                 3| 20000|
|  21|                 1| 15000|
|  23|                 2| 18000|
|NULL|              NULL| 38000|
|  34|                10|  NULL|
|  36|              NULL|  NULL|
+----+------------------+------+

In [7]:
df.na.drop().show() # this will remove rows where 'null' take place.
# In drop function -> how,thersh,subset

+---------+---+------------------+------+
|     Name|Age|Experience (Years)|Salary|
+---------+---+------------------+------+
|    Krish| 31|                10| 30000|
|Sudhanshi| 30|                 8| 25000|
|    Sunny| 29|                 4| 20000|
|     Paul| 24|                 3| 20000|
|   Harsha| 21|                 1| 15000|
|  Shubham| 23|                 2| 18000|
+---------+---+------------------+------+

In [8]:
# 1 -> how
df.na.drop(how='any').show() # by default how = any ->even one null in row meant it will drop

+---------+---+------------------+------+
|     Name|Age|Experience (Years)|Salary|
+---------+---+------------------+------+
|    Krish| 31|                10| 30000|
|Sudhanshi| 30|                 8| 25000|
|    Sunny| 29|                 4| 20000|
|     Paul| 24|                 3| 20000|
|   Harsha| 21|                 1| 15000|
|  Shubham| 23|                 2| 18000|
+---------+---+------------------+------+

In [9]:
df.na.drop(how='all').show()# how = all -> if row have all as null meant it will drop.in our case there is no row like that.

+---------+----+------------------+------+
|     Name| Age|Experience (Years)|Salary|
+---------+----+------------------+------+
|    Krish|  31|                10| 30000|
|Sudhanshi|  30|                 8| 25000|
|    Sunny|  29|                 4| 20000|
|     Paul|  24|                 3| 20000|
|   Harsha|  21|                 1| 15000|
|  Shubham|  23|                 2| 18000|
|   Mahesh|NULL|              NULL| 38000|
|     NULL|  34|                10|  NULL|
|     NULL|  36|              NULL|  NULL|
+---------+----+------------------+------+

In [10]:
# 2 -> thersh
df.na.drop(how='any',thresh=2).show() # we set threshold value as 2.It tells that each row should have atleast 2 non null value. If not meant drop it.

+---------+----+------------------+------+
|     Name| Age|Experience (Years)|Salary|
+---------+----+------------------+------+
|    Krish|  31|                10| 30000|
|Sudhanshi|  30|                 8| 25000|
|    Sunny|  29|                 4| 20000|
|     Paul|  24|                 3| 20000|
|   Harsha|  21|                 1| 15000|
|  Shubham|  23|                 2| 18000|
|   Mahesh|NULL|              NULL| 38000|
|     NULL|  34|                10|  NULL|
+---------+----+------------------+------+

In [11]:
# 3 -> subset
df.na.drop(how='any',subset=['Experience (Years)']).show() # if we want to drop null values only for specific column

+---------+---+------------------+------+
|     Name|Age|Experience (Years)|Salary|
+---------+---+------------------+------+
|    Krish| 31|                10| 30000|
|Sudhanshi| 30|                 8| 25000|
|    Sunny| 29|                 4| 20000|
|     Paul| 24|                 3| 20000|
|   Harsha| 21|                 1| 15000|
|  Shubham| 23|                 2| 18000|
|     NULL| 34|                10|  NULL|
+---------+---+------------------+------+

In [12]:
df.na.drop(how='any',subset=['Name','Salary']).show()

+---------+----+------------------+------+
|     Name| Age|Experience (Years)|Salary|
+---------+----+------------------+------+
|    Krish|  31|                10| 30000|
|Sudhanshi|  30|                 8| 25000|
|    Sunny|  29|                 4| 20000|
|     Paul|  24|                 3| 20000|
|   Harsha|  21|                 1| 15000|
|  Shubham|  23|                 2| 18000|
|   Mahesh|NULL|              NULL| 38000|
+---------+----+------------------+------+

In [13]:
# Fill the missing values
df.na.fill(value='hai').show() # now in value we pass string 'hai'.so it fill with 'hai' where string column have null.

+---------+----+------------------+------+
|     Name| Age|Experience (Years)|Salary|
+---------+----+------------------+------+
|    Krish|  31|                10| 30000|
|Sudhanshi|  30|                 8| 25000|
|    Sunny|  29|                 4| 20000|
|     Paul|  24|                 3| 20000|
|   Harsha|  21|                 1| 15000|
|  Shubham|  23|                 2| 18000|
|   Mahesh|NULL|              NULL| 38000|
|      hai|  34|                10|  NULL|
|      hai|  36|              NULL|  NULL|
+---------+----+------------------+------+

In [14]:
df.na.fill(value=999999999).show()# now we pass int so.it see int type columns have null and fill them.

+---------+---------+------------------+---------+
|     Name|      Age|Experience (Years)|   Salary|
+---------+---------+------------------+---------+
|    Krish|       31|                10|    30000|
|Sudhanshi|       30|                 8|    25000|
|    Sunny|       29|                 4|    20000|
|     Paul|       24|                 3|    20000|
|   Harsha|       21|                 1|    15000|
|  Shubham|       23|                 2|    18000|
|   Mahesh|999999999|         999999999|    38000|
|     NULL|       34|                10|999999999|
|     NULL|       36|         999999999|999999999|
+---------+---------+------------------+---------+

In [15]:
df.na.fill(value=999999999,subset=['Age','Salary']).show() # we can also specify the column also by using subset.

+---------+---------+------------------+---------+
|     Name|      Age|Experience (Years)|   Salary|
+---------+---------+------------------+---------+
|    Krish|       31|                10|    30000|
|Sudhanshi|       30|                 8|    25000|
|    Sunny|       29|                 4|    20000|
|     Paul|       24|                 3|    20000|
|   Harsha|       21|                 1|    15000|
|  Shubham|       23|                 2|    18000|
|   Mahesh|999999999|              NULL|    38000|
|     NULL|       34|                10|999999999|
|     NULL|       36|              NULL|999999999|
+---------+---------+------------------+---------+

In [20]:
# we can also fill the null values by their respective column mean,median,std....values etc..
# For that we us 'imputer' ->  it is works for only numeric columns.
from pyspark.ml.feature import Imputer

In [23]:
imputer = Imputer(
    inputCols=['Age','Experience (Years)','Salary'],
    outputCols=['{}_imputer'.format(c) for c in ['Age','Experience (Years)','Salary']]
).setStrategy('mean')

In [19]:
# them fit and transform imputer columns with df.
imputer.fit(df).transform(df).show() # its give imputer colum + excisting dataframe.

+---------+----+------------------+------+-----------+--------------------------+--------------+
|     Name| Age|Experience (Years)|Salary|Age_imputer|Experience (Years)_imputer|Salary_imputer|
+---------+----+------------------+------+-----------+--------------------------+--------------+
|    Krish|  31|                10| 30000|         31|                        10|         30000|
|Sudhanshi|  30|                 8| 25000|         30|                         8|         25000|
|    Sunny|  29|                 4| 20000|         29|                         4|         20000|
|     Paul|  24|                 3| 20000|         24|                         3|         20000|
|   Harsha|  21|                 1| 15000|         21|                         1|         15000|
|  Shubham|  23|                 2| 18000|         23|                         2|         18000|
|   Mahesh|NULL|              NULL| 38000|         28|                         5|         38000|
|     NULL|  34|                10|  NULL|         34|                        10|         23714|
|     NULL|  36|              NULL|  NULL|         36|                         5|         23714|
+---------+----+------------------+------+-----------+--------------------------+--------------+